dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC33xED/IfxAgbt_bf.h
/** \brief Mask for Ifx_AGBT_PYCR2_Bits.TXOCDSL */
#define IFX_AGBT_PYCR2_TXOCDSL_MSK (0x7u)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.TXOCDSL */
#define IFX_AGBT_PYCR2_TXOCDSL_OFF (16u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.TXDEEMPH */
#define IFX_AGBT_PYCR2_TXDEEMPH_LEN (1u)

/** \brief Mask for Ifx_AGBT_PYCR2_Bits.TXDEEMPH */
#define IFX_AGBT_PYCR2_TXDEEMPH_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.TXDEEMPH */
#define IFX_AGBT_PYCR2_TXDEEMPH_OFF (19u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.TXSERRST */
#define IFX_AGBT_PYCR2_TXSERRST_LEN (1u)

/** \brief Mask for Ifx_AGBT_PYCR2_Bits.TXSERRST */
#define IFX_AGBT_PYCR2_TXSERRST_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.TXSERRST */
#define IFX_AGBT_PYCR2_TXSERRST_OFF (20u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.CKRXDIV2 */
#define IFX_AGBT_PYCR2_CKRXDIV2_LEN (1u)

/** \brief Mask for Ifx_AGBT_PYCR2_Bits.CKRXDIV2 */
#define IFX_AGBT_PYCR2_CKRXDIV2_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.CKRXDIV2 */
#define IFX_AGBT_PYCR2_CKRXDIV2_OFF (22u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.CKRXTERM */
#define IFX_AGBT_PYCR2_CKRXTERM_LEN (3u)

/** \brief Mask for Ifx_AGBT_PYCR2_Bits.CKRXTERM */
#define IFX_AGBT_PYCR2_CKRXTERM_MSK (0x7u)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.CKRXTERM */
#define IFX_AGBT_PYCR2_CKRXTERM_OFF (24u)

/** \brief Length for Ifx_AGBT_PYCR2_Bits.TXSRINVC */
#define IFX_AGBT_PYCR2_TXSRINVC_LEN (1u)

/** \brief Mask for Ifx_AGBT_PYCR2_Bits.TXSRINVC */
#define IFX_AGBT_PYCR2_TXSRINVC_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_PYCR2_Bits.TXSRINVC */
#define IFX_AGBT_PYCR2_TXSRINVC_OFF (27u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.RBUF2G5 */
#define IFX_AGBT_PACR1_RBUF2G5_LEN (4u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.RBUF2G5 */
#define IFX_AGBT_PACR1_RBUF2G5_MSK (0xfu)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.RBUF2G5 */
#define IFX_AGBT_PACR1_RBUF2G5_OFF (8u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.IBUF2G5 */
#define IFX_AGBT_PACR1_IBUF2G5_LEN (2u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.IBUF2G5 */
#define IFX_AGBT_PACR1_IBUF2G5_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.IBUF2G5 */
#define IFX_AGBT_PACR1_IBUF2G5_OFF (12u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.IBUFDCO */
#define IFX_AGBT_PACR1_IBUFDCO_LEN (2u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.IBUFDCO */
#define IFX_AGBT_PACR1_IBUFDCO_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.IBUFDCO */
#define IFX_AGBT_PACR1_IBUFDCO_OFF (14u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.IDIV2F5G */
#define IFX_AGBT_PACR1_IDIV2F5G_LEN (2u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.IDIV2F5G */
#define IFX_AGBT_PACR1_IDIV2F5G_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.IDIV2F5G */
#define IFX_AGBT_PACR1_IDIV2F5G_OFF (16u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.IDIV4F5G */
#define IFX_AGBT_PACR1_IDIV4F5G_LEN (2u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.IDIV4F5G */
#define IFX_AGBT_PACR1_IDIV4F5G_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.IDIV4F5G */
#define IFX_AGBT_PACR1_IDIV4F5G_OFF (18u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.IDCOLDO */
#define IFX_AGBT_PACR1_IDCOLDO_LEN (2u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.IDCOLDO */
#define IFX_AGBT_PACR1_IDCOLDO_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.IDCOLDO */
#define IFX_AGBT_PACR1_IDCOLDO_OFF (20u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.IPICOND */
#define IFX_AGBT_PACR1_IPICOND_LEN (2u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.IPICOND */
#define IFX_AGBT_PACR1_IPICOND_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.IPICOND */
#define IFX_AGBT_PACR1_IPICOND_OFF (22u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.IPI */
#define IFX_AGBT_PACR1_IPI_LEN (2u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.IPI */
#define IFX_AGBT_PACR1_IPI_MSK (0x3u)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.IPI */
#define IFX_AGBT_PACR1_IPI_OFF (24u)

/** \brief Length for Ifx_AGBT_PACR1_Bits.BETALKD */
#define IFX_AGBT_PACR1_BETALKD_LEN (4u)

/** \brief Mask for Ifx_AGBT_PACR1_Bits.BETALKD */
#define IFX_AGBT_PACR1_BETALKD_MSK (0xfu)

/** \brief Offset for Ifx_AGBT_PACR1_Bits.BETALKD */
#define IFX_AGBT_PACR1_BETALKD_OFF (26u)

/** \brief Length for Ifx_AGBT_PACR2_Bits.RDIV2F5G */
#define IFX_AGBT_PACR2_RDIV2F5G_LEN (4u)

/** \brief Mask for Ifx_AGBT_PACR2_Bits.RDIV2F5G */
#define IFX_AGBT_PACR2_RDIV2F5G_MSK (0xfu)

/** \brief Offset for Ifx_AGBT_PACR2_Bits.RDIV2F5G */
#define IFX_AGBT_PACR2_RDIV2F5G_OFF (0u)

/** \brief Length for Ifx_AGBT_PACR2_Bits.RDIV4F5G */
#define IFX_AGBT_PACR2_RDIV4F5G_LEN (4u)

/** \brief Mask for Ifx_AGBT_PACR2_Bits.RDIV4F5G */
#define IFX_AGBT_PACR2_RDIV4F5G_MSK (0xfu)

/** \brief Offset for Ifx_AGBT_PACR2_Bits.RDIV4F5G */
#define IFX_AGBT_PACR2_RDIV4F5G_OFF (4u)

/** \brief Length for Ifx_AGBT_PACR2_Bits.DCLKDEN */
#define IFX_AGBT_PACR2_DCLKDEN_LEN (1u)

/** \brief Mask for Ifx_AGBT_PACR2_Bits.DCLKDEN */
#define IFX_AGBT_PACR2_DCLKDEN_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_PACR2_Bits.DCLKDEN */
#define IFX_AGBT_PACR2_DCLKDEN_OFF (8u)

/** \brief Length for Ifx_AGBT_PACR2_Bits.DCLKIEN */
#define IFX_AGBT_PACR2_DCLKIEN_LEN (1u)

/** \brief Mask for Ifx_AGBT_PACR2_Bits.DCLKIEN */
#define IFX_AGBT_PACR2_DCLKIEN_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_PACR2_Bits.DCLKIEN */
#define IFX_AGBT_PACR2_DCLKIEN_OFF (9u)

/** \brief Length for Ifx_AGBT_PACR2_Bits.FRACMEN */
#define IFX_AGBT_PACR2_FRACMEN_LEN (1u)

/** \brief Mask for Ifx_AGBT_PACR2_Bits.FRACMEN */
#define IFX_AGBT_PACR2_FRACMEN_MSK (0x1u)

/** \brief Offset for Ifx_AGBT_PACR2_Bits.FRACMEN */
#define IFX_AGBT_PACR2_FRACMEN_OFF (10u)

/** \brief Length for Ifx_AGBT_PACR2_Bits.LDOVREFS */
#define IFX_AGBT_PACR2_LDOVREFS_LEN (3u)

/** \brief Mask for Ifx_AGBT_PACR2_Bits.LDOVREFS */
#define IFX_AGBT_PACR2_LDOVREFS_MSK (0x7u)

/** \brief Offset for Ifx_AGBT_PACR2_Bits.LDOVREFS */
#define IFX_AGBT_PACR2_LDOVREFS_OFF (12u)

/** \brief Length for Ifx_AGBT_PACR2_Bits.MMDSEL */
#define IFX_AGBT_PACR2_MMDSEL_LEN (7u)

/** \brief Mask for Ifx_AGBT_PACR2_Bits.MMDSEL */
#define IFX_AGBT_PACR2_MMDSEL_MSK (0x7fu)

/** \brief Offset for Ifx_AGBT_PACR2_Bits.MMDSEL */
#define IFX_AGBT_PACR2_MMDSEL_OFF (16u)

